package net.lsun.bbs171.utils;

import org.apache.commons.lang.CharUtils;
import org.apache.commons.lang.StringUtils;
import org.springframework.stereotype.Component;

import javax.annotation.PostConstruct;
import java.util.HashMap;
import java.util.Map;

@Component
public class SensitiveFilterUtil {
    // 替换符
    private static final String REPLACEMENT = "***";
    // 根节点
    private final TrieNode rootNode = new TrieNode();
    // 敏感字
    String[] sensitiveWords = {
            "18禁",
            "a片",
            "caonima",
            "cnm",
            "caotama",
            "cao你",
            "cao你妈",
            "fa轮",
            "hjt",
            "jb",
            "jzm",
            "nmsl",
            "sb",
            "vpn",
            "zhengfu",
            "zheng府",
            "zf",
            "fuck",
            "zedong",
            "亂倫",
            "噴精",
            "姦淫",
            "屄",
            "屄毛",
            "幹炮",
            "幹砲",
            "擠乳汁",
            "溫家寶",
            "無毛穴",
            "獸交",
            "爱女人",
            "爱液",
            "扒穴",
            "拔屄自拍",
            "白虎阴穴",
            "白虎少妇",
            "白浆四溅",
            "包二奶",
            "薄熙来",
            "薄码",
            "暴奸",
            "爆乳娘",
            "爆草",
            "爆操",
            "被操",
            "被插",
            "被干",
            "逼痒",
            "逼奸",
            "博彩",
            "擦你妈",
            "操我",
            "操死",
            "操死你",
            "操你妈",
            "操你奶",
            "操你姐",
            "操逼",
            "操你祖宗",
            "操你大爷",
            "操你妹",
            "操穴",
            "操屄",
            "操他妈",
            "操你全家",
            "操烂",
            "操妻",
            "操你嘴",
            "操死她",
            "操b",
            "操它妈",
            "曹刚川",
            "草你祖宗",
            "草你大爷",
            "草你妈",
            "草你吗",
            "草bi",
            "草她妈",
            "草拟吗",
            "草你娘",
            "草他妈",
            "厕所盗摄",
            "厕奴",
            "插阴茎",
            "插逼",
            "插妹妹",
            "插穴止痒",
            "插死她",
            "插比",
            "插b",
            "插你",
            "陈同海",
            "陈水扁",
            "陈良宇",
            "成人片",
            "成人网站",
            "成人图",
            "成人电",
            "成人文",
            "成人视",
            "成人自拍",
            "成人小",
            "惩公安",
            "吃鸡巴",
            "抽插",
            "臭鸡八",
            "臭鸡吧",
            "床上写真",
            "催情藥",
            "催情药",
            "催眠水",
            "催情粉",
            "大奶子",
            "大肉棒",
            "大奶头",
            "大明运气咒",
            "大力抽送",
            "大血逼",
            "大雞巴",
            "大鸡巴",
            "大傻b",
            "戴秉国",
            "盗撮",
            "邓小瓶",
            "邓小平",
            "邓爷爷",
            "东北独立",
            "杜世成",
            "杜德印",
            "法lun",
            "法伦功",
            "法维权",
            "法一轮",
            "法正乾",
            "法车仑",
            "法轮佛",
            "法轮",
            "翻墙",
            "反共复清",
            "反华示威",
            "肥逼",
            "粉穴",
            "风艳阁",
            "干你妈",
            "干的爽",
            "干穴",
            "干你娘",
            "干你妹",
            "干死你",
            "干你全家",
            "肛交",
            "肛门",
            "肛门拳交",
            "给你爽",
            "根达亚文明",
            "共残主义",
            "狗娘养",
            "灌满精液",
            "郭金龙",
            "国峰",
            "国锋",
            "含屌",
            "喝血社会",
            "黑毛屄",
            "胡云松",
            "胡王八",
            "胡谨涛",
            "胡錦濤",
            "胡海峰",
            "胡主席",
            "胡春华",
            "胡温",
            "虎精逃",
            "华国",
            "黄色电影",
            "回良玉",
            "混蛋",
            "激情电",
            "激情妹",
            "激情炮",
            "激情短",
            "激情小说",
            "鸡巴",
            "鸡奸",
            "集体自杀",
            "挤乳汁",
            "几吧",
            "妓女",
            "家宝",
            "奸幼",
            "奸杀",
            "奸污",
            "践货",
            "贱人",
            "贱比",
            "江泽民",
            "江澤民",
            "江x",
            "江某某",
            "脚奴",
            "街头扒衣",
            "金毛穴",
            "锦涛",
            "精子射在",
            "警察说保",
            "警方包庇",
            "警车雷达",
            "警察殴打",
            "警察的幌",
            "就去日",
            "菊花洞",
            "巨乳",
            "恐怖份子",
            "恐怖分子",
            "抠穴",
            "口淫",
            "口交",
            "口活",
            "口内爆射",
            "狂乳激揺",
            "拉登",
            "浪逼",
            "浪叫",
            "雷管",
            "李小鹏",
            "李鹏",
            "李克强",
            "李洪志",
            "李世民",
            "習近平",
            "莲花逼",
            "炼大法",
            "梁光烈",
            "两会又三",
            "两会代",
            "刘延东",
            "露逼",
            "露b",
            "乱伦类",
            "乱奸",
            "乱伦小",
            "轮子功",
            "轮奸",
            "轮功",
            "伦理毛",
            "伦理电影",
            "伦理片",
            "伦理大",
            "裸舞视",
            "裸体",
            "裸聊网",
            "妈个逼",
            "妈了个逼",
            "妈了逼",
            "麻果配",
            "麻果丸",
            "麻古",
            "玛雅历法",
            "卖淫",
            "满狗",
            "肏屄",
            "氓培训",
            "猫贼洞",
            "毛主席",
            "毛遮洞",
            "毛则东",
            "毛泽东",
            "毛贼东",
            "毛澤東",
            "美女高潮",
            "美艳少妇",
            "妹按摩",
            "妹上门",
            "门按摩",
            "门保健",
            "蒙汗药",
            "孟建柱",
            "迷昏口",
            "迷奸",
            "迷魂香",
            "迷幻型",
            "迷幻药",
            "迷情药",
            "迷幻藥",
            "迷魂药",
            "迷藥",
            "迷奸药",
            "迷昏药",
            "迷昏藥",
            "迷魂藥",
            "迷情水",
            "谜奸药",
            "秘唇",
            "蜜穴",
            "密穴",
            "民抗议",
            "明慧网",
            "摸阴蒂",
            "某锦涛",
            "母奸",
            "母子乱伦",
            "母子奸情",
            "奶子",
            "男奴",
            "男女交欢",
            "内射",
            "嫩穴",
            "嫩b",
            "嫩逼",
            "嫩屄",
            "嫩bb",
            "嫩阴",
            "你妈死了",
            "你日妈",
            "你妈逼",
            "娘西皮",
            "娘了个比",
            "娘两腿之间",
            "浓精",
            "怒的志愿",
            "女优",
            "女任职名",
            "女人和狗",
            "女技师",
            "女激情",
            "女優",
            "女上门",
            "女被人家搞",
            "拍肩神药",
            "炮友",
            "喷尿",
            "屁眼",
            "平叫到床",
            "平惨案",
            "仆不怕饮",
            "普通嘌",
            "期货配",
            "奇迹的黄",
            "奇淫散",
            "强暴",
            "强硬发言",
            "强奸你妹",
            "强奸",
            "强权政府",
            "巧淫奸戏",
            "情色",
            "全裸",
            "全家死绝",
            "全家死光",
            "群奸暴",
            "群体性事",
            "群起抗暴",
            "群交",
            "绕过封锁",
            "人类灭亡",
            "人兽",
            "人妻",
            "人妻做爱",
            "人妻熟女",
            "人妻榨乳",
            "人体炸弹",
            "人妻色诱",
            "日中断交",
            "日你妹",
            "日烂",
            "日你全家",
            "日死你",
            "日你妈",
            "日逼",
            "肉棒",
            "肉壶",
            "肉蒲团",
            "肉便器",
            "肉茎",
            "肉淫器吞精",
            "肉棍",
            "肉穴",
            "肉逼",
            "肉棍干骚妇",
            "肉唇",
            "肉洞",
            "乳交",
            "软弱的国",
            "三秒倒",
            "三级片",
            "三挫",
            "三唑",
            "搔逼",
            "骚妇",
            "骚浪美女",
            "骚贱",
            "骚嘴",
            "骚姐姐",
            "骚母",
            "骚洞",
            "骚穴",
            "骚逼",
            "骚妹",
            "骚浪",
            "骚乳",
            "骚女",
            "骚水",
            "色妹妹",
            "色电影",
            "色视频",
            "色猫",
            "色小说",
            "色书库",
            "傻臂",
            "傻逼",
            "傻b",
            "傻避",
            "煞笔",
            "煞逼",
            "少妇",
            "舌头穴",
            "射颜",
            "射爽",
            "社会主义灭亡",
            "沈跃跃",
            "十八禁",
            "兽奸",
            "熟妇人妻",
            "爽片",
            "爽穴",
            "死全家",
            "死逼",
            "苏树林",
            "酥穴",
            "塔利班",
            "蘚鮑",
            "台湾",
            "台独",
            "台湾独立",
            "体奸",
            "天黯门",
            "天岸门",
            "天案们",
            "天安门大屠杀",
            "天氨门",
            "天安门",
            "天胺门",
            "天案门",
            "舔脚",
            "舔屄",
            "铁凝",
            "偷窥图片",
            "推背图",
            "退党",
            "吞精",
            "王胜俊",
            "王岐山",
            "王洛林",
            "王太华",
            "王鸿举",
            "瘟总理",
            "瘟加饱",
            "瘟假饱",
            "温影帝",
            "温家堡",
            "温切斯特",
            "温家宝",
            "温家某",
            "吴定富",
            "吴邦国",
            "吸精少女",
            "习近平",
            "洗肠射尿",
            "下流地带",
            "下贱",
            "销魂洞",
            "小穴",
            "小平遗言",
            "小逼崽子",
            "小平遗嘱",
            "新唐人",
            "性虐",
            "性奴",
            "性爱",
            "性爱图库",
            "颜射",
            "艳妇淫女",
            "要射精了",
            "要泄了",
            "要射了",
            "要人权",
            "耀邦",
            "叶剑英",
            "夜激情",
            "液体炸",
            "一夜欢",
            "遗嘱小平",
            "阴屄",
            "阴b",
            "阴茎",
            "阴唇",
            "阴部",
            "阴締",
            "淫贱",
            "淫叫",
            "淫液",
            "淫娃",
            "淫魔舞",
            "淫情",
            "淫肉",
            "淫蜜",
            "淫蕩",
            "淫汁",
            "淫姐",
            "淫妞",
            "淫逼",
            "淫亂潮吹",
            "淫荡",
            "淫騷妹",
            "淫情女",
            "淫奴",
            "淫兽",
            "淫兽学",
            "淫水",
            "淫妇",
            "淫穴",
            "淫水爱液",
            "淫母",
            "淫亂",
            "幼交",
            "玉穴",
            "原味内裤",
            "原味内衣",
            "援交妹",
            "杂种操的",
            "则民爷爷",
            "泽民",
            "炸立交",
            "炸弹遥控",
            "炸药的制",
            "炸药",
            "炸弹",
            "炸药配",
            "炸弹教",
            "炸鸟巢",
            "炸广州",
            "炸药制",
            "炸学校",
            "张志国",
            "张德江",
            "张荣坤",
            "政治局常委",
            "政fu",
            "政府",
            "制服狩",
            "中国人权",
            "中日断交",
            "朱镕基",
            "猪容鸡",
            "诸世纪",
            "主席",
            "主席像",
            "自焚",
            "自拍美穴",
            "自慰抠穴",
            "自慰",
            "总竖鸡",
            "总理",
            "总书记",
            "钻插",
            "做爱",
            "妞上门",
            "嫖妓指南",
            "嫖鸡",
            "嫖俄罗",
            "門服務",
            "陰道",
            "陰唇",
            "陰戶",
            "掰穴",
            "騷浪",
            "赌博",
            "嫖娼",
            "开票",
            "兼职",
            "吸毒"
    };

    @PostConstruct
    public void init() {
        for (String word : sensitiveWords) {
            this.addKeyword(word);
        }
    }

    // 将一个敏感词添加到前缀树中
    private void addKeyword(String keyword) {
        TrieNode tempNode = rootNode;
        for (int i = 0; i < keyword.length(); i++) {
            char c = keyword.charAt(i);
            TrieNode subNode = tempNode.getSubNode(c);

            if (subNode == null) {
                // 初始化子节点
                subNode = new TrieNode();
                tempNode.addSubNode(c, subNode);
            }

            // 指向子节点,进入下一轮循环
            tempNode = subNode;

            // 设置结束标识
            if (i == keyword.length() - 1) {
                tempNode.setKeywordEnd(true);
            }
        }
    }

    /**
     * 过滤敏感词
     *
     * @param text 待过滤的文本
     * @return 过滤后的文本
     */
    public String filter(String text) {
        if (StringUtils.isBlank(text)) {
            return null;
        }

        // 指针1
        TrieNode tempNode = rootNode;
        // 指针2
        int begin = 0;
        // 指针3
        int position = 0;
        // 结果
        StringBuilder sb = new StringBuilder();

        while (position < text.length()) {
            char c = text.charAt(position);

            // 跳过符号
            if (isSymbol(c)) {
                // 若指针1处于根节点,将此符号计入结果,让指针2向下走一步
                if (tempNode == rootNode) {
                    sb.append(c);
                    begin++;
                }
                // 无论符号在开头或中间,指针3都向下走一步
                position++;
                continue;
            }

            // 检查下级节点
            tempNode = tempNode.getSubNode(c);
            if (tempNode == null) {
                // 以begin开头的字符串不是敏感词
                sb.append(text.charAt(begin));
                // 进入下一个位置
                position = ++begin;
                // 重新指向根节点
                tempNode = rootNode;
            } else if (tempNode.isKeywordEnd()) {
                // 发现敏感词,将begin~position字符串替换掉
                sb.append(REPLACEMENT);
                // 进入下一个位置
                begin = ++position;
                // 重新指向根节点
                tempNode = rootNode;
            } else {
                // 检查下一个字符
                position++;
            }
        }

        // 将最后一批字符计入结果
        sb.append(text.substring(begin));

        return sb.toString();
    }

    // 判断是否为符号
    private boolean isSymbol(Character c) {
        // 0x2E80~0x9FFF 是东亚文字范围
        return !CharUtils.isAsciiAlphanumeric(c) && (c < 0x2E80 || c > 0x9FFF);
    }

    // 前缀树
    private static class TrieNode {

        // 子节点(key是下级字符,value是下级节点)
        private final Map<Character, TrieNode> subNodes = new HashMap<>();
        // 关键词结束标识
        private boolean isKeywordEnd = false;

        public boolean isKeywordEnd() {
            return isKeywordEnd;
        }

        public void setKeywordEnd(boolean keywordEnd) {
            isKeywordEnd = keywordEnd;
        }

        // 添加子节点
        public void addSubNode(Character c, TrieNode node) {
            subNodes.put(c, node);
        }

        // 获取子节点
        public TrieNode getSubNode(Character c) {
            return subNodes.get(c);
        }

    }
}
